let Data = JSON.parse(localStorage.getItem('Data'));
let newsData = [
        {
            title:"周杰伦最新专辑《最伟大的作品》已上线",
            content:[
                "《最伟大的作品》是周杰伦的第15张音乐专辑，由周杰伦担任制作人，共收录12首歌曲，同名先行曲《最伟大的作品》于2022年7月6日中午12点首播。完整专辑于2022年7月14日21点30分正式发布。",
                "2021年5月12日，周杰伦凭借该专辑中的歌曲《Mojito》入围第32届台湾金曲奖最佳单曲制作人奖。2023年4月26日，周杰伦凭借该专辑入围第一届浪潮音乐大赏最佳男歌手的奖项，该专辑也入围了第一届浪潮音乐大赏最佳制作荣誉。",
                "早在2017年，周杰伦就曾对歌迷说要发行新专辑，但这个承诺一直没有实现。而距离他上一张专辑2016年发行的《周杰伦的床边故事》也已过去六年时间。2022年6月19日晚，周杰伦在社交平台发布纪录片《周杰伦2022年专辑前导·巴黎创作纪录片》，在时长11分08秒的纪录片末尾，用法文写着“2022年7月15日新专辑发行”，这才预告了该专辑确切发行时间。",
                "有的听众认为专辑的名称《最伟大的作品》是周杰伦过于自信的一种方式。但该专辑名称并不是说周杰伦的作品很伟大，它的核心在于艺术创作都是最伟大的，都是艺术家想和这个世界对话交流、沟通的一个方式。因为当一件伟大的作品被创作出来时，艺术家们并不会知道，他们自己会成就整个艺术时代。",
                "在专辑前导纪录片中，周杰伦通过vlog形式透露要“写一首老歌”，为此他带着一群人在巴黎旧货市场寻找老旧的麦克风、乐器等匹配歌曲风格，随后前往歌剧院录制配唱。另外，为了寻找灵感，他还特地找到了一架1812年的旧钢琴。作为周杰伦的好友，黄雨勋依然参与了该专辑的编曲。专辑发行前几年，周杰伦陆续发表了一些单曲，在《Mojito》发布之后，周杰伦认为接下来应该要出专辑了，他也把之前只有数位发行的几首单曲收录在了专辑中。",
                "该专辑的《Intro》钢琴曲是电影《不能说的秘密》中的曲目《琴房》的变奏版。周杰伦想透过音乐将绘画、文学等艺术结合在一起，所以在专辑同名歌曲《最伟大的作品》的MV里面呈现了许多周杰伦的狂想：在现代的某个夜晚，来到巴黎历史悠久的莎玛丽丹百货公司弹奏钢琴时，突然瞬移到1920年，遇到了马格利特、达利、常玉、莫奈、徐志摩，周杰伦以魔术与艺术家们幽默互动，让大师们有了新的创作灵感，这些伟大的艺术作品流传至今。周杰伦表示，这首曲子在几年前早有构想。而最特别的是，这首歌是先拍好了MV，再请作词人根据MV剧情内容填词，歌词除了写到MV中出现的马格利特、达利、常玉、莫奈、徐志摩之外，还将梵高、蒙克等人物写入词里。为了能全面体现复古，他更是跑到巴黎歌剧院录制了人声。",
                "周杰伦尽管工作满档，还是不忘写歌创作录音，总是在令人意想不到的地方写歌，《不爱我就拉倒》就是在演唱会后台准备梳化时创作的，当时周杰伦听见弹头打电话时说了一句“不要就拉倒啊！”，周杰伦觉得很久没听到“拉倒”这句话了，于是灵感一触即发，演出完就跟乐手老师借了一把吉他，要弹头到他房间一起写歌，一直写到凌晨5点才完成这首歌。“Mojito”是一种传统的古巴鸡尾酒，更是大文豪海明威的最爱，如缪斯女神般存在的“Mojito”，让黄俊郎以此酒为主题，为《Mojito》充满古巴风情、带着轻快的节奏、随兴摇摆的曲风而进行创作。"
            ]
        }, {
            title:"李荣浩《纵横四海》获十大金曲奖",
            content:[
                "《纵横四海》是李荣浩的第七张音乐专辑，共收录10首歌曲，发行于2022年12月21日，由李荣浩担任制作人。2022年，专辑同名歌曲《纵横四海》获得第29届东方风云榜“十大金曲奖”。",
                "《纵横四海》的专辑概念由中国香港电影而来，李荣浩被“港片”里的豪迈与义气所打动，因此想用旋律传达这些核心精神。他希望通过该专辑传达出关于生活、关于改变、关于人生的深刻和美好。整张专辑中，从词曲创作到乐器演奏，再到歌曲后期制作都由李荣浩包办 。专辑中收录了一首翻唱自Beyond乐队的歌曲《情人》，李荣浩在该曲结尾进行了一段长达数分钟的吉他Solo。",
                "因为李荣浩喜欢粤语歌曲，所以他为专辑同名曲《纵横四海》设定了20世纪八九十年代的复古风格。李荣浩希望为专辑打造一首华语流行音乐“黄金时代”的风格，让歌曲回归到情绪、情感和感性的主线，因此创作出歌曲《对等关系》，并邀请张惠妹共同参与演唱。李荣浩出道以后，凭借个人特色的情歌风格受到认可，因此他根据第一视角阐述“现代恋爱关系的矛盾纠葛”，创作出歌曲《脱胎换骨》。",
                "专辑《纵横四海》收录了10首李荣浩风格的歌曲。虽水准不及此前的专辑作品，但整体尚可，其中的歌曲《纵横四海》《山川》品质不错。即便是翻唱Beyond的《情人》，李荣浩在结尾也有一段长达数分钟的个人吉他Solo，可以看出他的用心。考虑到这是一张具有复古概念的专辑，其整体弥漫着一种对于港片港乐的怀旧氛围，在第九首的位置插入《乌梅子酱》这样的情歌小品，或也可看作是为听众留下舒缓空间的设置。",
                "《脱胎换骨》是一首关于现代恋爱真实写照的虐心情歌，带有明显的“李式情歌”特色，淡淡诉说着亲密关系中独有的矛盾与纠葛，既延续了前面几首抒情歌的叙事感，又令专辑有了“脱胎换骨”的新鲜风格，在其整张专辑中，很好地起到了承上启下的作用。《乌梅子酱》的主歌写得别致，副歌朗朗上口，仿佛小情侣夏天喝着汽水吹着风的甜蜜，便于传唱。它既有大众流行性，也有小众的独特气质。其编曲、旋律营造出的甜甜恋爱感，颇具“洗脑神曲”的潜质。",
                "《对等关系》把一段亲密关系的纠结与拉扯唱进歌里，听来虐心，却并非是常规的虐爱情歌。在表面的互撕之下，这依然是一首暖心的情歌，虽然结局收场很悲伤，但感情里相处的时光却充满着回忆。在感性的氛围中，其实也包含着理性那一面。整首作品男女声的对唱，让作品听起来张力十足，歌曲的设计展现了李荣浩和张惠妹各自音域的特点，还能够因为声音的重叠而生成一种奇妙的化学反应，单纯通过情绪推动的声线，让人体会到一首男女对唱情歌的魅力。"
            ]
        }, {
            title:"陈奕迅新专辑《CHIN UP!》“别垂头丧气”",
            content:[
                "《CHIN UP!》是陈奕迅于2023年10月27日发行的音乐专辑，共收录6首粤语歌曲和2首普通话歌曲，由陈奕迅、林家谦担任制作人。2023年7月1日，周耀辉凭借专辑收录曲《人啊人》获得第34届台湾金曲奖最佳作词人奖。",
                "《CHIN UP!》共收录6首粤语歌曲和2首普通话歌曲，专辑概念来自陈奕迅在英国留学时，经常听到的一句话：Keep Your Chin Up（别垂头丧气）。昔日一句简单的鼓励，后来令陈奕迅明白：原来只要下巴挺起，没有什么是挺不过去的。陈奕迅希望通过该专辑，为正在经历人生跌宕起伏的人们注入能量与活力，在他的歌声里抬头仰望，振作精神直面未来。",
                "专辑设计由刘建文担任，他以一个在玩攀登架的俏皮小孩呈现“下巴挺起”的核心精神。除此之外，刘建文还加入了不少巧思，例如将封面逆时针转动90度，封面底部加入9片彩云，灵感来自英文谚语“on cloud nine”，即一种快乐到顶点的状态。专辑顶部的星形吊灯不单纯是点缀，而是寓意“shoot for the stars（迈步向梦想进发）。",
                "2017年，陈奕迅结识了词曲创作人林家谦，两人交换联系方式后，林家谦发了十几首歌曲小样给陈奕迅，其中就包括了歌曲《是但求其爱》《致明日的舞》。陈奕迅最终选择了歌曲《致明日的舞》，因为当时《是但求其爱》并未打动他。陈奕迅希望《致明日的舞》可以让听众感到轻松，也想通过该曲传达出“不要孤单、不要沮丧”的信息。",
                "2019年年底，陈奕迅接到了自己合作多次的作词人小克的电话，小克表示自己很想写词。陈奕迅便把林家谦创作的歌曲小样发给了小克，小克选择了歌曲《是但求其爱》，最终只用了五个多小时便将歌词创作了出来。陈奕迅在收到歌曲《人啊人》的小样时就十分喜欢，而在后续的制作过程中，陈奕迅与制作人们还进行了一场关于人的深刻思考。陈奕迅希望听众通过该曲，能够在人生的旅途中收获治愈与希望。"
            ]
        }, {
        title:"邓紫棋新专辑《启示录》已上线",
        content:[
            "《启示录》是邓紫棋于2022年8月9日发行的音乐专辑，共收录14首歌曲，由邓紫棋担任制作人。2022年，该专辑获得微博视界大会突破创新音乐连续剧奖、亚洲流行音乐大奖年度最佳专辑奖。2023年，邓紫棋凭借该专辑获得浪潮音乐大赏最佳女歌手奖、年度专辑奖。",
            "《启示录》是邓紫棋时隔三年后发行的音乐专辑，这三年间世界发生了很多变化。作为歌手的邓紫棋明白自己能做的，就是用音乐向听众传递生命力，于是她创作了专辑《启示录》。音乐录影带方面，邓紫棋首次担任主创、编剧及监制，联同林博导演共同打造了14集音乐连续剧MV，串起起来是一个有连续剧情的故事。故事以乐土、废土、现实世界为背景，呈现当代社会的真实面貌，包括人对自我形象缺乏安全感的挣扎和焦虑、在生活种种挫折下的迷失，还有网络暴力对人心与关系的撕裂等问题。邓紫棋表示当代已经很少有观众能耐心完整地听完一首歌，但是她却有很多启示想与大家分享，于是想到了音乐连续剧这一形式，希望能吸引观众用心听完专辑里的每首作品。",
            "先行曲《GLORIA》的歌名源自邓紫棋的父亲给她小时候取的英文名，同时也是专辑《启示录》中女主角的名字。邓紫棋从小时候历经情感创伤，到成为公众人物难免遭遇网络暴力，而后来所历经的官司、诉讼，都让她备感压力。某天她向上帝祈祷时，突然脑中浮现了一段一直唱着“Gloria”的旋律，瞬间她感到风平浪静，于是也就有了《启示录》的创作灵感。邓紫棋想借《GLORIA》告诉大家，无论世界发生了怎么样变化，唯有自爱才能不被打败。只要相信爱的指引，最终定能驱散阴霾，迎来曙光。",
            "《你不是第一个离开的人》以钢琴、管弦乐作为伴奏，创作灵感来自法国作家维克多·雨果的小说《笑面人》。邓紫棋出道以来，经历了各种悲欢离合，她想用该曲诉说自己对于离别的感悟：这世界上没有永远留下的人，只有还没离开的人。《受难曲》是邓紫棋根据自己遭受网络暴力的经历而创作的歌曲。曾被网络暴力中伤的邓紫棋终日以泪洗面，虽然找到了面对的方法。但网络暴力仍然存在，并给人们的生活带来多不胜数的悲剧，邓紫棋想借该曲呼吁大众共同拒绝网络暴力。《少年与海》《老人与海》两首歌的歌词以一问一答的方式串联在一起，灵感均来自于邓紫棋在阅读美国作家海明威的小说《老人与海》时产生的共鸣：人生正如同汹涌的海浪，每个人都孤独的前行在风浪之中。",
            "邓紫棋认为“爱”是给予对方选择的权利，凡事相信、盼望、忍耐、包容，只有这样才能让那些可能会“离心”的人们仍有选择的自由，于是她创作了歌曲《离心力》，并首次尝试迷幻迪斯科曲风。在被生活中的困境包围得寸步难行时，邓紫棋不禁向上帝祈祷能不能让世界暂停一分钟，并以此为灵感创作了歌曲《让世界暂停一分钟》，希望可以传递给听众治愈的力量。在邓紫棋踏入30岁的阶段时，她感觉自己的世界要大放异彩，她的天空没有极限。这是邓紫棋对自己的一种期许，于是她创作了歌曲《天空没有极限》。结尾大合唱部分，邓紫棋邀请了M9 Marginal Youth Singing Choir一众与她有共同信仰的年轻人参与演唱，以此寓意新的一代同样有着无边的未来。"
        ]
    }
]

$(document).ready(function () {

    let code = decodeURI(window.location.search);
    code = code.substring(code.indexOf("=") + 1);
    code = parseInt(code) - 1;

    let title = newsData[code].title;
    $("#newsTitle").text(title);

    let imageSrc = "images/news/" + (code+1) + ".png";
    $("#newsImage img").attr("src", imageSrc);

    let stringList = newsData[code].content;
    for(let i = 0 ; i < stringList.length ; i++){
        $("#newsText").append(stringList[i] + "<br><br>");
    }

    $("#search-button").on("click", function(){
        searchAlbum($("#search-input").val());
    })
    $('#search-input').on('keypress', function(event) {
        console.log(event.which);
        event.preventDefault();
        if (event.which === 13) {
            searchAlbum($(this).val());
        }
    });
})

function searchAlbum(str){
    if(str.length === 0) return;
    for(let i = 0 ; i < Data.length ; i ++){
        if(Data[i].name.indexOf(str) !== -1){
            window.location = "details.html?code=" + (i+1);
            return;
        }
    }
    window.alert("未在专辑库中找到 ： " + str);
}